app/controllers/categories_controller.rb

INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 19 Aug 2013 18:24:51 UTC +00:00], ["name", "Mark's category"], ["updated_at", Mon, 19 Aug 2013 18:24:51 UTC +00:00]]
---
  def create
    @category = Category.new(params.require(:category).permit(:name))

    if @category.save