app/controllers/comments_controller.rb

  def create
    @post = Post.find_by(slug: params[:post_id])
    @comment = Comment.new(params.require(:comment).permit(:body))
    @comment.post = @post
    @comment.creator = current_user

   if @comment.save
---
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "hey all"], ["created_at", Mon, 26 Aug 2013 16:01:29 UTC +00:00], ["post_id", 1], ["updated_at", Mon, 26 Aug 2013 16:01:29 UTC +00:00], ["user_id", 3]]