app/controllers/posts_controller.rb

def create
  @post = Post.new(params.require(:post).permit!)
  @post.creator = current_user
  if @post.save
---
INSERT INTO "posts" ("created_at", "title", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Mon, 26 Aug 2013 18:41:16 UTC +00:00], ["title", "This is my first post"], ["updated_at", Mon, 26 Aug 2013 18:41:16 UTC +00:00], ["url", "http://www.google.com"], ["user_id", 1]]

def update
  if @post.update(post_params)
---
UPDATE "posts" SET "url" = ?, "updated_at" = ? WHERE "posts"."id" = 2  [["url", ""], ["updated_at", Fri, 30 Aug 2013 16:21:49 UTC +00:00]]

def vote


Vote.create(voteable: @post, creator: current_user, vote: params[:vote])
---
INSERT INTO "votes" ("created_at", "updated_at", "user_id", "vote", "voteable_id", "voteable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 27 Aug 2013 06:02:54 UTC +00:00], ["updated_at", Tue, 27 Aug 2013 06:02:54 UTC +00:00], ["user_id", 2], ["vote", true], ["voteable_id", 1], ["voteable_type", "Post"]]

def set_post
  @post = Post.find_by(slug: params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."slug" = '#<#<Class:0x00000105948440>:0x00000105953778>' ORDER BY "posts"."id" ASC LIMIT 1