app/controllers/sessions_controller.rb

  def create
    #get handle on user (username)
    user = User.find_by(username: params[:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = '' LIMIT 1