app/controllers/users_controller.rb

  def create
    @user = User.new(users_params)


    if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username") VALUES (?, ?, ?)  [["created_at", Fri, 23 Aug 2013 15:10:59 UTC +00:00], ["updated_at", Fri, 23 Aug 2013 15:10:59 UTC +00:00], ["username", ""]]